{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "appeal to emotion",
    "1": "false causality",
    "2": "ad populum",
    "3": "circular reasoning",
    "4": "fallacy of relevance",
    "5": "faulty generalization",
    "6": "ad hominem",
    "7": "fallacy of extension",
    "8": "equivocation",
    "9": "fallacy of logic",
    "10": "fallacy of credibility",
    "11": "intentional",
    "12": "false dilemma"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ad hominem": 6,
    "ad populum": 2,
    "appeal to emotion": 0,
    "circular reasoning": 3,
    "equivocation": 8,
    "fallacy of credibility": 10,
    "fallacy of extension": 7,
    "fallacy of logic": 9,
    "fallacy of relevance": 4,
    "false causality": 1,
    "false dilemma": 12,
    "faulty generalization": 5,
    "intentional": 11
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
